NordicPlayground/nrf52-ble-multi-link-multi-role/ble_peripheral/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;
            
        case BUTTON_2:
// ### ------------------ TASK 3: STEP 1 ------------------
// ### Add code to request the PHY to be updated when Button 2 is pressed
// ### Hint 1: To check if the button is pressed or not you can check if button_action == APP_BUTTON_PUSH
// ### Hint 2: You can use the sd_ble_gap_phy_request function to ask for an updated PHY. 
// ###         The first argument to this function is the connection handle, which is stored in the m_conn_handle variable
// ###         The second argument is a pointer to a struct of type ble_gap_phys_t, which contains fields for requesting a change to the TX and RX phy
// ###         You can ask for the TX and RX PHY to be the same, and you can choose between the following values: BLE_GAP_PHY_2MBPS, BLE_GAP_PHY_1MBPS or BLE_GAP_PHY_CODED
            if(button_action == APP_BUTTON_PUSH)
            {
                NRF_LOG_INFO("Send phy update request.");
                phys.rx_phys = BLE_GAP_PHY_2MBPS;
                phys.tx_phys = BLE_GAP_PHY_2MBPS;
         
                err_code = sd_ble_gap_phy_request(m_conn_handle, &phys);
                APP_ERROR_CHECK(err_code);        
            }
// ### ----------------------------------------------------
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler},
        {BUTTON_2, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    leds_init();
    timers_init();

// ### ------------------ TASK 4: STEP 3 ------------------
// ### Create your timer by using app_timer_create(app_timer_id_t const * p_timer_id, 
// ###                                             app_timer_mode_t mode, 
// ###                                             app_timer_timeout_handler_t timeout_handler)
// ### The app_timer_id_t should point to the variable you created in step 1.
// ### The app_timer_mode should be APP_TIMER_MODE_REPEATED. 
// ### The timeout handler should point to the function you created in step 2
    uint32_t err_code = app_timer_create(&m_data_update_timer, APP_TIMER_MODE_REPEATED, data_update_callback);
    APP_ERROR_CHECK(err_code);
// ### ----------------------------------------------------

    log_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
